Revit 2016 API
TessellatedShapeBuilder Properties
The TessellatedShapeBuilder type exposes the following members.
Properties
Name | Description
IsFaceSetOpen
 Flag whether the current set of connected faces is open and additional tessellation faces can be added to it.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LogInteger
 Integer value used for logging, if it is performed. Usually the number of the face set(s) in the IFC file, from which they are imported. Any value is acceptable.
LogString
 String used for logging, if any. Usually the name of the file from which face sets were imported.
NumberOfCompletedFaceSets
 Number of completed face sets.
OwnerInfo
 String used for logging, if any. Usually describes the element or object, which either defined or will own the geoemtrical objects to be built.
See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace